Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བྲམ་ཟེའི་ཁྱེའུ་རྨོངས་པ་དེ། །དབུལ་བ་ཁྲོ་བ་ཆགས་པ་ཡིས། །རྒྱལ་པོའི་སྲོག་ལ་གནོད་པའི་ཕྱིར། །ཁྲོ་བོའི་སྔགས་ནི་ཟློས་པར་བྱེད། །
en: “This foolish young brahmin, however, Stricken with poverty and swayed by anger and greed, Will recite the Krodha [mantra] In order to kill the king. {53.887}

source: དེ་འོག་རྣམ་པར་གྲགས་པ་ནི། །བྲམ་ཟེ་ཡི་གེ་དང་པོ་ཨ། །
en: “There will also be another brahmin, Known by the name beginning with S.

source: ཆོས་དོན་དགེ་བ་ལྡན་བདག་ཉིད། །བདེན་པར་སྨྲ་ཞིང་དབང་པོ་ཐུལ། །
en: He will be skilled in the art of mantras, studious, Truthful, and in control of his senses. {53.888}

source: མངའ་བདག་མང་པོས་བཀུར་ཅེས་པ། །དེ་ཚེ་སྔགས་ནི་ཟློས་པར་འགྱུར། །
en: “A reciter of mantras, He will be known as a very powerful master.

source: སྔགས་ནི་བསྒྲུབ་པར་གྱུར་པ་ལ། །དབང་འགྱུར་ཡིན་གྱིས་གཞན་མ་ཡིན། །
en: He will master the mantras for enthralling, But not for other activities.

source: འབྱུང་པོ་དབང་དུ་གྱུར་པ་ན། །དེ་ཚེ་ནོར་དང་ལྡན་པར་འགྱུར། །
en: As the result of enthralling the spirits, He will become very rich. {53.889}

source: དེ་འོག་རྣམ་པར་གྲགས་པ་ནི། །བྲམ་ཟེ་ཆོས་དོན་སེམས་བྱེད་པ། །དེ་ནས་མཐར་ནི་དང་ཡིག་ཤ། །མ་ལའི་ཡུལ་དུ་དེ་ནི་འབྱུང་། །
en: “There will be another well-known brahmin In the country of Mālava, Concerned about the affairs of the Dharma, Whose name will begin with Ś.

source: ས་སྟེང་སྔགས་ནི་ཟློས་པར་གྲགས། །བསྟན་པ་མཆོག་ལའང་རབ་ཏུ་དད། །
en: He will have faith in the teachings And will be an exemplary reciter of mantras on earth. {53.890}

source: རིག་པ་རྗེས་བཟུང་མ་རུངས་དང་། །ཚངས་པའི་སྲིན་པོ་སྲིན་པོ་དང་། །འབྱུང་པོ་ཤིན་ཏུ་མ་རུངས་བཅས། །རྣམ་པ་སྣ་ཚོགས་ཤ་ཟ་དང་། །
en: “He will enthrall vetālas, grahas, The evil brahmarākṣasas and rākṣasas, And all the pūtanas, bhūtas, And the various kravyādas. {53.891}

source: བསྟན་དང་འགྲོ་བ་སྣ་ཚོགས་ནི། །དེ་དག་མ་ལུས་དེ་དབང་འགྱུར། །
en: “All animate and inanimate things Without exception will come under his control.

source: དེ་བཞིན་བྲམ་ཟེའི་མཚན་ལྡན་པ། །ཐམས་ཅད་དེ་ཡི་དབང་དུ་འགྱུར། །
en: All of them will be in his thrall, With benefits for this man marked as twice-born. {53.892}

source: དེ་འོག་རྣམ་པར་གྲགས་པ་ནི། །ལྷོ་ཡི་ཕྱོགས་སུ་བྲམ་ཟེ་ནི། །ཡི་གེ་དང་པོར་བ་བསྟན་པ། །སྟོན་པའི་བསྟན་ལ་དེ་གཙོར་བྱེད། །
en: “There will be another brahmin In the southern region. He will be widely known by the name beginning with V And will be devoted to the teachings of the Teacher. {53.893}

source: མཆོད་རྟེན་ཀུན་དགའ་ར་བ་གནས། །སྟོན་པའི་གཟུགས་བརྙན་ཡིད་འོང་གིས། །ས་ནི་རྒྱ་མཚོ་གཉིས་མཐར་ཐུག །ཐམས་ཅད་ཀྱི་ནི་རྒྱན་དུ་བྱས། །
en: “He will adorn the entire land Between the two oceans With monasteries, ashrams, caityas, And beautiful images of the Teacher. {53.894}

source: དེ་འོག་རྣམ་པར་གྲགས་པ་ནི། །བྲམ་ཟེ་གཙོ་བོ་ནོར་ཆེན་ལྡན། །དང་པོའི་ཡི་གེ་ན་ཞེས་པ། །ལྷོ་ཡི་ཕྱོགས་སུ་ཡང་དག་བསྟན། །
en: “Another distinguished brahmin, Known by the name beginning with Bh, Wealthy and famous, Will live in the southern region. {53.895}

source: བདག་ཉིད་ཆེན་པོ་སྔགས་ཟློས་ལྡན། །ངེས་པར་བྱང་ཆུབ་གཞོལ་བར་འགྱུར། །
en: “This great being, a reciter of mantras, Will be destined to attain the final goal of awakening.

source: དབུས་ཀྱི་ཡུལ་དུ་བསྟན་པ་ནི། །བྲམ་ཟེ་གང་བ་བཟང་ཞེས་པ། །
en: In Madhyadeśa, there will be a brahmin Known by the name of Sampūrṇa. {53.896}

source: འདུལ་བ་དང་ནི་ཚུལ་བཟང་ཉིད། །གང་བ་བཅོམ་བརླག་དག་ཏུ་གནས། །
en: “There will also be Vinaya , Suvinaya, And Pūrṇa, the citizen of Mathurā.

source: དང་ཡིག་བྷ་ནི་ནོར་གྱི་སྤྱན། །རྒྱལ་པོ་རྣམས་ནི་སྔགས་མཆོད་བྱེད། །
en: There will be a royal treasurer with the initial Bh, A worshiper of mantra [deities]. {53.897}

source: བྲམ་ཟེ་འདི་དག་བསྟན་པ་ནི། །སྟོན་པའི་བསྟན་པ་མཆོད་བྱེད་པའོ། །ཐོག་མ་བར་མཐར་གཙོ་བོ་སྟེ། །རྣམ་པ་སྣ་ཚོགས་གནས་དང་རིགས། །
en: “These brahmins, foretold as Worshipers of the Teacher’s teachings, Will be members of different houses and lineages, Prominent at the beginning, middle, and end. {53.898}

source: སྣ་ཚོགས་ཕྱོགས་ཀྱི་བྲམ་ཟེ་རྣམས། །བྲམ་ཟེ་གཞན་གྱིས་མཆོད་པར་བྱེད། །
en: “These and other brahmins will worship Among [other] brahmins in different places.

source: མུ་སྟེགས་སྣ་ཚོགས་རིགས་དང་ནི། །རྣམ་པ་སྣ་ཚོགས་སྤྱོད་ཡུལ་སྤྱོད། །
en: They will belong to different brahmanical orders and lineages And will follow different types of practices.

source: གནས་ནི་ཀུན་ཏུ་གསུངས་པ་སྟེ། །བྲམ་ཟེའི་ཁྱེའུ་མང་ཐོས་ཡིན། །
en: They are foretold as full-fledged ascetics, Ordained as novices and very learned. {53.899}

source: རང་བྱུང་སངས་རྒྱས་ཆོས་ཀྱི་རྒྱལ། །སེམས་ཅན་ཀུན་གྱི་དོན་སྒྲུབ་པ། །སེམས་ཅན་རྣམས་ནི་མ་ལུས་དང་། །ལྷ་གནས་ཀྱིས་ཀྱང་མཆོད་པའོ། །
en: “The self-realized buddha, the Dharma king Who fulfills the aims of all beings, Is glorified by all the spirits And also by the three gods. {53.900}

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཡང་། །འཇིག་རྟེན་ཀུན་ལ་གྲགས་པ་སྟེ། །
en: “The four great kings Are celebrated in all the worlds.

source: འཕགས་སྐྱེས་པོ་དང་མིག་མི་བཟང་། །ཡུལ་འཁོར་སྲུང་དང་གནོད་སྦྱིན་རྒྱལ། །བརྒྱ་བྱིན་དེ་ནས་ལྷ་རྣམས་ཀྱི། །ངེས་པའི་ཚིག་ནི་རབ་ཏུ་བསྒྲགས། །
en: They are Virūḍhaka, Virūpākṣa, Dhṛtarāṣṭra, and the king of the yakṣa s. Śakra is glorified as The long-lived among the gods. {53.901}

source: འཐབ་བྲལ་ལྷ་ཡི་བུ་དང་ནི། །འཕྲུལ་དགའ་གཞན་འཕྲུལ་དབང་བྱེད་དང་། །རྒྱལ་པོ་དགའ་ལྡན་གསུངས་པ་དང་། །འདོད་པའི་ཁམས་ཀྱི་དབང་ཕྱུག་མཆོག །
en: “There are the gods of the Suyāma, Sunirmita, and Vaśavartin realms, And the king called Santuṣita Is said to be the supreme lord of the desire realm. {53.902}

source: གཅིག་གི་མིང་ནི་བརྒྱ་བྱིན་སོགས། །དེ་བཞིན་འདོད་ཁམས་དབང་ཕྱུག་ཡིན། །
en: “Śakra and the other individually named gods Are, likewise, lords of the desire realm.

source: དེ་ཡང་རྟག་ཏུ་གཅིག་གནས་ཏེ། །རྫུ་འཕྲུལ་ཆེན་པོ་གཅིག་གི་གཟུགས། །
en: Endowed with powers and majesty, they share a single nature, Always being one and the same person. {53.903}

source: དེ་ཡང་མཐའ་ཡས་དག་ཏུ་བསྟན། །རྣམ་པ་སྣ་ཚོགས་གཟུགས་འཆང་ལྷ། །
en: “The gods who possess different forms Are described as infinite.

source: དེ་ལས་གོང་དུ་ཐམས་ཅད་མཉམ། །དེ་ཡང་ཐམས་ཅད་རྫུ་འཕྲུལ་ཆེ། །
en: The gods above them are all equal, With equal powers and majesty. {53.904}

source: ལྷ་ཡི་གཙོ་བོ་མིང་གཅིག་སྟེ། །འདུ་ཤེས་མེད་པའི་མཐར་ཡང་བསྟན། །
en: “Known to be this way, The higher gods are said to be in harmony.

source: དེ་དག་གཙོ་བོ་མེད་པ་སྟེ། །མཉམ་པའི་ཚུལ་དུ་ཡང་དག་གནས། །
en: There is no overlord among them, As they are all of the same status. {53.905}

source: འོག་ཏུ་མནར་མེད་མཐར་ཐུག་པར། །དེར་ནི་རྒྱལ་པོ་ཡོད་མ་ཡིན། །
en: “Below, down to the Avīci hell, There is no king to be found.

source: འཇམ་དཔལ་དེ་བས་ན། དེ་ལྟར་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས་སུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་མཛོད་འདི་གླེགས་བམ་དུ་ཆུད་པར་བྱས་ཏེའདྲི་བར་འགྱུར། ཀློག་པར་འགྱུར། ཁ་ཏོན་དུ་བྱེད་པར་འགྱུར་བའམ་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བར་འགྱུར། །གུས་པར་བྱས་ཏེ་ཡིད་ལ་བྱེད་པར་འགྱུར། །གོས་རྣམ་པ་སྣ་ཚོགས་དང་། ཕྱེ་མ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། དྲིལ་བུ་དང་། རོལ་མོ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། སྤོས་དང་། དྲི་དང་། དྲི་ཞིམ་པོ་དག་གིས་མཆོད་པར་བྱེད་པར་འགྱུར། །
en: “One should know, Mañjuśrī, divine youth, about the ten advantages obtained in any place where this Dharma treasury of the tathāgatas is written down in the form of a book, read aloud, memorized, or respectfully and sincerely worshiped with various implements such as yak-tail whisks, streamers, parasols, banners, flags, bells, music, garlands, scented oils, incense, or pleasant fragrances.

source: ཡང་དག་པར་འཛིན་པར་བྱེད་པར་འགྱུར། །ཡིད་རྩེ་གཅིག་པའི་སེམས་ཀྱིས་ཆོས་བྱེད་པར་འགྱུར་བ་དེ་ལ་ནི། །ཕན་ཡོན་བཅུ་པོ་འདི་དག་ཏུ་འགྱུར་ཏེ། །
en: These ten advantages are obtained in any place where this Dharma treasury is revered, reflected upon, or focused upon with an undivided mind.

source: བཅུ་གང་ཞེ་ན།
en: What are these ten? {54.3}

source: དེར་འདི་ལ་ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར། །
en: “There will be (1) no danger in that [place] of military invasions or hunger;

source: མི་མ་ཡིན་པའི་འཇིགས་པའམ། དེར་འདི་ལ་མིའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར། །
en: (2) no pestilence caused by Mahāmārī or other dangers from nonhuman beings;

source: ཆར་ཆེས་པའི་འཇིགས་པའམ། དེར་འདི་ལ་རླུང་ཆེན་པོའི་དཀྱིལ་འཁོར་གྱི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: (4) no danger of drought or excessive rains; (5) no danger of hurricanes, tornadoes, or kravyādas;

source: ཤ་ཟ་ཐམས་ཅད་ཀྱི་འཇིགས་པའམ། དེར་འདི་ལ་དགྲའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: (6) no danger from Śakra or any rogues or robbers;

source: གཤིན་རྗེའི་རྒྱལ་པོས་ཁྱེར་བའི་འཇིགས་པའམ། དེར་འདི་ལ་ཆོམ་རྐུན་གྱི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: (7) no danger of untimely death or fear caused by King Yama;

source: ལྷ་ཐམས་ཅད་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟའི་འཇིགས་པའམ།
en: (8) no danger from asuras or any gods, nāga s, yakṣa s, or gandharvas;

source: དེར་འདི་ལ་གཞན་གྱི་སྔགས་ཀྱི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་རོ། །
en: (9) no danger from mantras, venoms, or poisons;

source: སྦྱར་བའི་དུག་ཐམས་ཅད་ཀྱི་འཇིགས་པའམ། དེར་འདི་ལ་ནད་ཀྱི་འཇིགས་པ་དང་། རིམས་དང་། ཚད་པར་འཁྲུ་བ་དང་། མ་ཞུ་བ་དང་། ཡན་ལག་དང་། ཉིང་ལག་གི་ནད་ཀྱི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་ཏེ
en: and (10) no danger of disease, fever, dysentery, indigestion, or other danger to body or limb.

source: ཕན་ཡོན་བཅུ་པོ་འདི་དག་ཏུ་ཤེས་པར་བྱའོ། །གང་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོ་ག་ཆེན་པོ་རབ་འབྱམ་ཆོས་ཀྱི་མཛོད་འདི་གླེགས་བམ་དུ་བྱས་ཏེ། བཞག་ལ་འདྲི་བ་དང་། ཀློག་པ་དང་། མཆོད་པ་དང་། འཛིན་པ་དང་ཁ་ཏོན་དུ་བྱེད་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཤིན་ཏུ་བཟུང་ཞིང་ཆོས་ཀྱི་མཛོད་མངོན་དུ་འགྱུར་རོ། །
en: One should know that these ten benefits occur wherever this Dharma treasury of the tathāgatas, contained in this great extensive manual, is kept in the form of a book. Let us therefore write it down, read it aloud, worship it, memorize it, and rehearse it. {54.4}

source: དམ་ཚིག་གི་སྤྱོད་པ་ལ་རྗེས་སུ་མ་ཞུགས་པ་དང་དམ་ཚིག་མི་ཤེས་པ་གཞན་དག་ལ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་བསྟན་པར་མི་བྱ་སྟེ། གང་གི་ཕྱིར་འདི་ནི་གསང་བ་ཡིན་པའི་ཕྱིར་ཏེ། འདིས་ནི་ཐམས་ཅད་མཚོན་པ་ཡིན་ན་སེམས་ཅན་རྣམས་ཀྱི་དྲན་པ་མེད་པར་མ་བྱེད་ཅིག །
en: “This Dharma treasury of the tathāgatas is extremely occult, as it depends in every respect on the mantras. It must not be taught to those who have not received the samaya from the master or those who do not understand the samaya.

source: འོན་ཀྱང་ཁྱོད་ཀྱིས་ཤེས་པར་འགྱུར་མཆོད་པ་བྱེད་པར་འགྱུར་ཡང་དག་པར་འཛིན་པར་འགྱུར་ཞིང་བསོད་ནམས་ཆེན་པོ་ཡང་རབ་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །
en: Why is this? This is because it is secret; it is an occult teaching. It is a teaching [arising from] omniscience.

source: སེམས་ཅན་སྐལ་བ་མེད་པ་རྣམས་ལ་བསྟན་པར་མི་བྱ་སྟེ།
en: No beings should ever reject or take it lightly. {54.5}

source: གཞན་དུ་ན་དབུལ་བ་དང་། ནད་དང་། མཛེ་དང་། འཚེ་བ་དང་། འགོ་བའི་ནད་ཉིད་བྱེད་པར་འགྱུར་རོ། །
en: “If [those who received it] do not worship [this Dharma treasury] and treat it with respect, they will incur a lot of negativity.

source: དེ་བས་ན་གཞན་དག་ལ་ཡང་བསྟན་པར་མི་བྱའོ། །
en: One must not disclose it to others,

source: དམ་ཚིག་དང་གསང་བ་པ་དང་གསང་བའི་སྔགས་ཀྱི་སྤྱོད་པ་ལ་རྗེས་སུ་ཞུགས་པའི་སེམས་ཅན་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ལེགས་པར་བསླབ་པ་རྣམས་དང་ལེགས་པར་རྣམ་པར་བཞག་པའི་དྲན་པ་དང་ལྡན་པ་རྣམས་དང་། ཆོས་ཀྱི་དོན་ལ་མཁས་པ་རྣམས་དང་བསམ་གཏན་ལ་རབ་ཏུ་ཞུགས་པ་དང་ཆོས་ལ་གནས་པ་དང་བདེན་པར་སྨྲ་བ་དང་སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་རབ་ཏུ་གནས་ཤིང་སྙིང་རྗེའི་སྤྱོད་པ་དང་རབ་ཏུ་ལྡན་པ་རྣམས་ཏེ། སེམས་ཅན་འདི་དག་ལ་བསྟན་པར་བྱའི་གཞན་དག་ལ་ནི་མ་ཡིན་ནོ། །
en: as they could commit negative acts, such as suppressing the secret [practices], killing sentient beings, reporting [you] to the king, shortening lives, or causing other misfortunes. It can only be disclosed to beings who have taken up the secret practice of mantras and keep their samaya secret—to beings who are well established and trained in the study and practice of the Tathāgata’s instructions, who have good knowledge of the meaning of the Dharma, who keep their samaya concerning the sense bases and psychophysical elements, and who live by the Dharma and are thus true to their promises, firm in their observances, have entered the path of good conduct, and are compassionate. It can be disclosed only to them and not to others.” {54.6}

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། །ཐལ་མོ་སྦྱར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva Mañjuśrī, the divine youth, rose from his seat, draped his robe over one shoulder, placed his right knee on the ground, and asked the Blessed One with folded hands,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ཞེས་བྱ། །འདི་བདག་གིས་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: “What is this Dharma discourse really, O Blessed One? What should I remember it as?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied: {54.7}

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as a basket of bodhisattva teachings, the thundering roar of all the buddhas and bodhisattvas.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ཀྱི་མན་ངག་ལེགས་པར་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as a text that contains the marvelous and wondrous Dharma instructions.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྗེས་སུ་འཇུག་པ་རྒྱུད་ཐམས་ཅད་ཀྱི་མཛོད་ཅེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as the bodhisattvas’ instructions for taking up all the practices of the ‘mantra basket.’

source: ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པ་ངེས་པར་བསྟན་པ་ཉམས་པ་མེད་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as an extensive Mahāyāna sūtra with marvelous instructions.

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as the root manual of Noble Mañjuśrī.

source: ཆོས་ཐམས་ཅད་ཀྱི་དོན་རྫོགས་པ་ངེས་པར་བསྟན་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: “You should remember it as the instructions that fulfill all the aims of the Dharma. {54.8}

source: འཇིག་རྟེན་མ་ལུས་ཐམས་ཅད་ལ། །ཆོས་དང་ཆོས་མིན་རྣམ་སྤྱོད་ཅིང་། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེ། །
en: “You are a very powerful bodhisattva Who travels everywhere Throughout every realm where there are Those who practice the Dharma and those who do not. {54.9}

source: གང་ཁྱོད་ཀུན་ཏུ་རྣམ་པར་རྒྱུ། །དེ་བཞིན་ཆོས་ཀྱི་དམ་པ་མཆོག །གསང་བ་གཞན་ནི་མ་མཐོང་ངོ་། །
en: “Do you not see that this profoundly secret teaching Is the best of the best among the sūtras

source: སྔགས་རྒྱུད་དོན་དང་མདོ་རྣམས་དང་། །འགྲོ་བ་ཡུལ་ནི་སྐྱོན་མེད་དང་། །
en: That treat the subject of the mantra methods, As it removes the dangers related to the place of rebirth? {54.10}

source: བྱང་ཆུབ་ཆོས་ལ་རབ་གཞོལ་བ། །དཔའ་བོ་གཞན་ནི་མ་མཐོང་ངོ་། །
en: “Do you not see, O valiant one, That this supreme teaching has awakening as its goal?

source: གང་འདི་བླ་མ་གསང་བ་དང་། །དྲང་དོན་མདོ་ཡིས་ཡོངས་སུ་བརྒྱན། །
en: That an esoteric sūtra such as this Is adorned with the meaning that needs to be inferred? {54.11}

source: རྣམ་པ་སྣ་ཚོགས་མདོ་དོན་དང་། །སྔགས་དང་རྒྱུད་ཀྱི་རྗེས་འཇུག་པ། །
en: “The diverse meanings of the sūtras Are presented here according to the mantra system.

source: ཆོ་ག་རབ་འབྱམ་འདི་ལས་གཞན། །མ་བྱུང་གང་ཡང་ཡོད་མ་ཡིན། །
en: There is no other such sūtra in existence, Apart from this extensive manual of rites. {54.12}

source: རྒྱལ་སྲིད་ཆེན་པོ་ལོངས་སྤྱོད་ཆེ། །ལྷ་གནས་དག་ཏུའང་ཕུན་སུམ་ཚོགས། །དེ་བཞིན་ལྷ་དང་མི་རྣམས་ཀྱི། །གྲགས་པ་རྒྱས་པའང་ཐོབ་པར་འགྱུར། །
en: “One can obtain kingship, great comforts, The great fortunes of the gods, Prosperity, and fame, Both celestial and human. {54.13}

source: མི་ཁོམ་བརྒྱད་ནི་སྤོང་བྱེད་ཅིང་། །དལ་བ་དག་ནི་ཐོབ་པར་བྱེད། །
en: “One will be able to avoid the eight unfree states, And bring about the eight freedoms.

source: ཐེག་པ་རྣམ་གསུམ་བདག་པོ་དང་། །དེ་ངེས་སངས་རྒྱས་ཉིད་ཐོབ་འགྱུར། །
en: One will become a master of the three vehicles Destined to attain buddhahood. {54.14}

source: མདོ་འདི་འཛིན་པའི་བསོད་ནམས་དང་། །དེ་བཞིན་དུ་ནི་ཕན་ཡོན་འདི། །
en: “There is merit in memorizing this sūtra And there are the following advantages:

source: འདི་ཡི་ལུས་ལ་མཚོན་མི་འབྱུང་། །དུག་དང་མེས་ཀྱང་མ་ཡིན་ནོ། །
en: Neither poison nor fire will be able To harm any part of one’s body, {54.15}

source: རོ་ལངས་དང་ནི་གདོན་དང་ནི། །དེ་བཞིན་སྲུལ་པོ་མ་མོ་དང་། །སྲིན་པོ་ཤ་ཟས་འཚེ་བྱེད་པའང་། །གང་ཞིག་མདོ་འདི་འདོན་ལ་མིན། །འཆང་བ་དང་ནི་ཀློག་པ་དང་། །ཡང་དང་ཡང་དུ་མཆོད་བྱེད་དང་། །འཇིགས་པ་མེད་པས་མཆོད་བྱེད་དང་། །རྣམ་པ་སྣ་ཚོགས་མཆོད་བྱེད་དེ། །
en: “And whatever vetālas, grahas, Pūtanas, mātṛs, thieves, Rākṣasas, or piśācas there are, {54.16} “They will not be able to harm Someone who recites this sūtra, Memorizes it, or worships it, again and again, With offerings of various kinds. {54.17}

source: ཕན་ཡོན་འདི་ནི་རབ་བསྟན་པ། །འཇིག་རྟེན་འདིར་ནི་ཐོབ་འགྱུར་བ། །ནད་པ་རྣམས་ནི་ནད་ལས་གྲོལ། །
en: One will then obtain The following advantages: {54.18} “If one is unwell, one will be freed from disease.

source: སྡུག་བསྔལ་ཅན་ནི་བདེ་བར་འགྱུར། །
en: If one experiences suffering, one will become happy.

source: དབུལ་པོས་ནོར་ནི་རྙེད་འགྱུར་ཏེ། །
en: If one is poor, one will obtain wealth.

source: བཅིངས་པ་རྣམས་ནི་འཆིང་ལས་གྲོལ། །
en: If one is in bondage, one will be freed. {54.19}

source: འགྲོ་བ་ལྔ་དང་ལྡན་པ་ཡི། །འཁོར་བའི་སྡུག་བསྔལ་ལྟུང་བ་རྣམས། །བདེ་བ་ཞི་བ་མྱ་ངན་འདས། །མི་གཡོ་གོ་འཕང་འཐོབ་པར་འགྱུར། །
en: “One who has fallen into the suffering of saṃsāra With its five realms of rebirth Will attain the unwavering state Of well-being, happiness, and nirvāṇa. {54.20}

source: རང་རྒྱལ་སངས་རྒྱས་ཉིད་དང་ནི། །ཉན་ཐོས་མཐར་ནི་ཕྱིན་པར་འགྱུར། །
en: “One will realize the awakening of a pratyeka­buddha Or attain the state of a śrāvaka.

source: མདོ་སྡེ་འདི་ནི་བཀླག་པ་ཡིས། །སངས་རྒྱས་སྐུ་མདོག་ཐོབ་པར་འགྱུར། །
en: If one reads this sūtra aloud, One will attain buddhahood. {54.21}

source: གང་གཱའི་བྱེ་མ་མཉམ་པ་ཡིས། །རྒྱལ་བ་མཆོག་ནི་མཐའ་ཡས་པ། །མཆོད་པས་ཐོབ་པའི་བསོད་ནམས་དང་། །མདོ་འདི་བཏོན་པའི་བསོད་ནམས་མཉམ། །
en: “The merit of reciting this sūtra is the same as All the merit that one would obtain through Worshiping the victorious ones, said to be As uncountable as the sand grains in the Gaṅgā. {54.22}

source: འཇིག་རྟེན་ཇི་སྙེད་གང་སུ་དག །ཞིང་ནི་བྱེ་བ་མཐའ་ཡས་པ། །དེ་སྲིད་ཕྲ་རབ་རྡུལ་སྙེད་ཀྱི། །
en: “If one were to continually worship the names Of the buddhas as numerous as the atoms In the tens of millions of inconceivable [buddha]fields, However many there are in this world; {54.23}

source: སངས་རྒྱས་རྣམས་ལ་རྟག་མཆོད་པ། །རྣམ་པ་སྣ་ཚོགས་བཟའ་བཏུང་དང་། །ན་བ་རྣམས་ཀྱི་གསོ་སྨན་དང་། །རྣམ་པ་སྣ་ཚོགས་གནས་མལ་རྣམས། །རྟག་ཏུ་ཐམས་ཅད་རབ་སྦྱིན་དང་། །
en: “If one were to offer to these buddhas various types Of food, drink, invigorating tonics, And various seats and beds, Giving them continually to all of them;

source: རྣམ་པ་སྣ་ཚོགས་གོས་དང་ནི། །ཕྱེ་མ་དག་ནི་ཀུན་གྱིས་ཀྱང་། །བསོད་ནམས་སྐྱེ་བོས་ཐོབ་གང་ཡིན། །འདི་དག་འཆང་དང་ཀློག་པས་སོ། །
en: “And if one were to offer them various garments, Scented powders, robes, ornaments, Parasols, shoes, cloth, Fragrances, garlands, unguents, {54.25} “And various types of incense, With lamps all around, The merit thus obtained would be the same As the merit obtained by memorizing and reciting this teaching. {54.26}

source: གང་ཞིག་རང་སངས་རྒྱས་རྣམས་དང་། །འཇིག་རྟེན་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེ། །བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་ཆེ། །ས་བཅུ་ལ་གནས་དེ་ལས་གཞན། །
en: “However many pratyeka­buddhas there are In this world, or śrāvakas of great majesty, Or bodhisattvas, great beings Established on the tenth level, {54.27}

source: དེ་རྣམས་ཚད་ནི་དེ་མཉམ་ལ། །དེ་དག་མཆོད་པའང་དེ་བཞིན་ཏེ། །གང་གི་ལག་པར་གླེགས་བམ་ཆུད། །མི་ཡིས་དེ་མཉམ་བསོད་ནམས་ཐོབ། །
en: “The merit that one would obtain Through worshiping them Would be the same as the merit of someone Who holds [this sūtra] volume in their hand. {54.28}

source: འཇིག་རྟེན་ཇི་སྙེད་བསྟན་པ་ཡང་། །འཇིག་རྟེན་ཁམས་ན་གནས་པ་ཡི། །གྲངས་མེད་སེམས་ཅན་མ་ལུས་པ། །ཐམས་ཅད་ནད་ནི་མེད་བྱས་ཏེ། །
en: “However many beings are said to dwell In the world with its spheres, Who are described as being free From the fever [of the afflictions], {54.29}

source: སྐྱེ་བོ་གང་ཞིག་ཡང་དང་ཡང་། །བཀུར་སྟིར་བྱས་ནས་དེ་མཆོད་པ། །ཆོས་མཆོག་འདི་ལ་མཆོད་ན་ནི། །བློ་ལྡན་དེ་ཡིས་བསོད་ནམས་འཐོབ། །
en: “The merit that one would obtain Through worshiping them sincerely, again and again, Would be the same that a wise person would obtain Through worshiping this supreme teaching. {54.30}

source: བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་པར། །རྒྱལ་བ་མཆོག་གིས་རྟག་པར་ཡང་། །འཇིག་རྟེན་མགོན་ཆོས་མཛད་མཆོག་འདི། །མཆོད་པར་ཡང་ནི་མི་ནུས་སོ། །
en: “Not even the most eminent, jewel-like victors Can obtain the same merit in tens of millions of eons That one can obtain through worshiping This finest Dharma treasury of the lords of the world. {54.31}

source: ཆོས་མཆོག་འདི་ནི་ས་སྟེང་དུ། །ཡིད་བཞིན་ནོར་བུ་རིན་ཆེན་འདྲ། །འཇམ་པའི་ཆོ་ག་འདིར་གསུངས་པ། །བཀླགས་པ་དང་ནི་འཆང་བ་ཡིས། །དེས་ནི་འདོད་འཇོའི་བ་འདྲར་འགྱུར། །
en: “If one recites and memorizes the mantras Taught by Mañjughoṣa in this manual, This supreme teaching will become A precious wish-fulfilling jewel. {54.32}

source: ལོངས་སྤྱོད་ཆེ་ནོར་ཕུན་སུམ་ཚོགས། །ཡིད་ནི་སྐྱོ་བ་མེད་བྱས་ནས། །
en: “It will become a cow of plenty for the reciter, And a source of great enjoyment and wealth.

source: ས་སྟེང་འདི་ནི་རབ་ཏུ་སྒྲུབ། །སྔགས་དང་རྒྱུད་དོན་དྲང་བའི་དོན། །
en: If someone with an indefatigable mind Accomplishes these mantras here on earth, {54.33}

source: དོན་ཡོད་ཚིག་ནི་རབ་བཤད་པ། །བྱ་བ་དུས་ལ་བརྟེན་ནས་ནི། །ས་སྟེང་རིག་པ་འཛིན་བསྒྲུབ་ན། །
en: “They will bring results, as taught by the Sage, With the inferred meaning becoming the true meaning. If one performs the rites at the right time, One will become a vidyādhara on earth. {54.34}

source: རིན་ཆེན་ཕུན་ཚོགས་རབ་གང་བ། །དེ་ཡི་ཕྱོགས་ཀུན་དག་ཏུ་གསུངས། །
en: “All the places, it is said, will be replete for him With precious good fortune.

source: འབྲས་བཅས་འགྲོ་བའི་བདག་ཉིད་ཆེ། །སྤྱོད་པ་བཟང་བར་བརྗོད་པ་ཡིན། །
en: His illustrious course of rebirths will be fruitful, And his actions will be praised by the good. {54.35}

source: གང་ཞིག་ཆོ་ག་མཆོག་འདི་ལས། །རྒྱལ་པོ་སྔགས་གཅིག་འཆང་བྱེད་པ། །རྒྱལ་སྲིད་ཕུན་སུམ་ཚོགས་དོན་བཅས། །ཚེ་རིང་ཕུན་སུམ་ཚོགས་པར་འགྱུར། །
en: “Should a king memorize a single mantra From this excellent manual, He will obtain a royal fortune with all its benefits, And a long and prosperous life. {54.36}

source: རྣམ་པ་སྣ་ཚོགས་ལོངས་སྤྱོད་ཚོགས། །རྒྱལ་མཆོག་དམ་པས་འཐོབ་པར་འགྱུར། །
en: “Such a distinguished king will obtain A life of various pleasurable pursuits.

source: འགྲོ་དང་གནས་པའི་དུག་དག་དང་། །གཞན་གྱིས་བྱས་པའི་རིག་པ་དང་། །
en: He will not be harmed by weapons or poisons, Whether from animate or inanimate sources, {54.37}

source: རོ་ལངས་སྔགས་ཀྱིས་སྒྲུབ་པ་དང་། །མཚོན་གྱིས་ཀྱང་ནི་གནོད་མི་འགྱུར། །
en: “Or the effects of inimical magical vidyā s, Such as the mantras employed in the vetāla practices.

source: གཞན་གྱི་གནོད་བྱེད་གཙོར་བྱེད་པས། །ས་སྟེང་འཇིག་རྟེན་གནོད་མི་བྱེད། །
en: Corrupt practitioners who engage in hostile rites Here on earth will not be able to harm him. {54.38}

source: ཆོམ་རྐུན་ནད་ནི་གཞན་དག་དང་། །མེ་ཡི་འཇིགས་པ་དེ་ལ་མེད། །རྒྱལ་པོ་སྐྱེ་བོ་དག་ཀྱང་རུང་། །སུ་ཞིག་དེ་ལ་མཆོད་མི་བྱེད། །
en: “He will not be in any danger of fire. Malevolent grahas or other such beings Will not assail his body, regardless of Whether he is a king or an ordinary person. {54.39}

source: གང་ཞིག་མདོ་སྡེ་དཀོན་མཆོག་འདི། །འཆང་དང་ཀློག་པའང་དེ་བཞིན་ནོ། །
en: “The same applies to any person who memorizes And recites this excellent sūtra of great importance.

source: རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས། །དབང་བསྐུར་ཡུལ་དུ་ཉེར་གནས་ཚེ། །མདོ་སྡེ་མགོ་ལ་ངེས་བཅིངས་ནས། །ཡང་དང་ཡང་དུ་ཕྱག་འཚལ་ན། །
en: Any king who, before a battle, Places it upon his head, {54.40} “So that it forms a parasol above it, And repeatedly pays homage to it,

source: དེ་ལ་རྐུན་པོས་མི་གནོད་ཅིང་། །མཚོན་གྱིས་དེ་ལ་ཕོག་མི་འགྱུར། །
en: Will not be killed by lowly men With any of their various weapons. {54.41}

source: གཞོན་ནུའི་གཟུགས་སུ་ཡང་དག་བྱུང་། །རྨ་བྱའི་གདན་ལ་ལེགས་བཀོད་པ། །གླང་པོའི་མཚོག་མའི་སྟེང་བཞག་ནས། །
en: “If he sends into battle An effigy of the princely youth, Seated on a peacock seat And mounted on the back of an elephant, {54.42}

source: གཡུལ་དུ་ཡང་དག་ཞུགས་བྱས་ན། །སྐྱེ་བོ་རྣམས་སྡང་དེ་དག་ཀུན། །མཐོང་བ་ཙམ་གྱིས་ལྡོག་པར་བྱེད། །བྱིས་པའི་གཟུགས་ཅན་བཟང་པོ་ནི། །གཞོན་ནུའི་རྒྱན་གྱིས་ཡོངས་སུ་བརྒྱན། །
en: “The enemies, seeing the divine youth In his youthful form Adorned with ornaments, Will all become mutually hostile and retreat. {54.43}
